var obj = {

  //平台入驻商审核状态
  platfromMemberStatus: {
    10: '开户驳回',
    15: '平台驳回',
    20: '待分部审核',
    25: '待运营审核',
    30: '待财务审核',
    35: '待客户支付',
    40: '待财务确认',
  },
  //平台会员审核状态
  platfromSupplierStatus: {
    10: '开户驳回',
    15: '平台驳回',
    20: '待采销审核',
    25: '待财务审核',
    30: '待客户支付',
    35: '待财务确认',
  },
  hspStatus: { //慧闪购状态
    0: '待审核',
    1: '审核通过',
    2: '卖家停止',
    3: '平台停止',
    '-1': '审核失败'
  },
  yanType: { //严选类型
    1: '爆款',
    2: '专款',
    3: '毛利王',
    4: 'OEM',
  },
  orderStatus: { //订单状态
    1: '待付款',
    2: '待发货',
    3: '部分发货',
    4: '已发货',
    5: '已收货',
    6: '交易完成',
    0: '交易关闭',
  },
  payType: { //订单支付方式
    1: '线下对公转账',
    2: '游易付',
    3: '手机APP支付',
    4: '支付宝',
    5: '微信支付',
  },
  goodsStatus: {
    1: '上架',
    0: '下架',
    3: '待审核',
    4: '审核中',
    5: '审核失败',
    6: '停用',
    '-1': '回收站',
    '-2': '卖家删除',
  },
  toBuyStatus: { //求购状态
    1: '提交求购',
    2: '匹配中',
    3: '匹配成功',
    4: '匹配失败',
    5: '审核拒绝'
  },
  platfromFeedBackType: { //意见反馈人类型
    2: '慧买卖入驻商',
    3: '慧买卖会员',
    4: '家电汇入驻商',
    5: '家电汇会员'
  },
  sellerAccountStatus: {
    1: '正常',
    2: '待运营审核',
    3: '待财务审核',
    10: '冻结',
    11: '到期',
  },
  sellerRZStatus: {
    1: '认证成功',
    2: '待提交',
    3: '认证中',
    4: '驳回'
  },
  memberShopAccountStatus: {
    '-1': '待缴费',
    '0': '待提交资料',
    '1': '正常',
    '4': '审核失败',
    '2': '待运营审核',
    '3': '待财务审核',
    '10': '冻结',
    '11': '到期',
  },
  JDHactivityGoodsAuditStatus: {//家电汇活动商品审核状态
    0: '待审核',
    1: '审核通过',
    2: '审核拒绝',
    '-1': '已移除'
  }
};

module.exports = obj;