/**
 * 通用词典文件，添加字段时，自动生成对应键值的Vue过滤器
 * zhaoliubin
 */
var obj = {
  carriageChargingMode: { //运费模板单位
    1: '件',
    2: '公斤',
    3: '立方米'
  },
  carriageChargingModeDetail: { //运费模板类型描述
    1: '件',
    2: '重量',
    3: '体积'
  },
  carriageChargingModeText: { //运费模板文本
    1: '件（件）',
    2: '重（公斤）',
    3: '体积（m³）'
  },
  hspStatus: { //慧闪购及严选单据状态
    0: '待审核',
    1: '审核通过',
    2: '卖家停止',
    3: '平台停止',
    '-1': '审核失败'
  },
  hspCheckStatus: { //审核状态
    0: '待审核',
    1: '审核通过',
    2: '已暂停',
    3: '已结束',
    4: '未开始',
    5: '进行中',
    '-1': '审核拒绝',
  },
  yanType: { //严选类型
    1: '爆款',
    2: '专款',
    3: '毛利王',
    4: 'OEM',
  },
  orderStatus: { //订单状态
    1: '待付款',
    2: '待发货',
    3: '部分发货',
    4: '已发货',
    5: '已收货',
    6: '交易完成',
    0: '交易关闭',
  },
  afterSaleReturnType: { //售后类型
    1: '仅退款',
    2: '退货退款',
    3: '换货',
  },
  afterSaleOrderStatus: { //售后状态
    1: '待商家处理',
    2: '待买家退货',
    3: '待商家收货',
    4: '待商家发货',
    5: '待买家确认换货',
    6: '退款中',
    7: '待平台仲裁',
    10: '商家拒绝',
    11: '成功',
    '-1': '售后关闭'
  }
};

module.exports = obj;