var obj = {
  gender: {
    0: '保密',
    1: '男',
    2: '女'
  },
  source: {
    0: '未知',
    1: '零售开单',
    2: '粉丝',
    3: '手工添加',
    4: '批量导入'
  },
  labelType: {
    0: '自定义',
    1: '系统内置'
  },
  labelColorList: {
    0: '#1AD7BA',
    1: '#1AD777',
    2: '#92D71A',
    3: '#E0DA32',
    4: '#EA8E33',
    5: '#E04B32',
    6: '#FF762E',
    7: '#DF49B3',
    8: '#B349DF',
    9: '#7349DF'
  },
  purchaseSource: {
    1: '零售开单',
    2: '会员中心',
    3: '扫码购买',
    4: '储值赠送',
  },
  orderState: {
    1: '待付款',
    3: '待确认可发货',
    // 10: '已付款',
    13: '待出库',
    15: '待发货',
    20: '待收货',
    '0280': '待核销',
    '030': '交易关闭',
    '040': '交易完成',
  }
};
// console.log(obj);

module.exports = obj;